In [ ]:
"""import pandas as pd

# Define the file paths
na_file_path = r"C:\Users\heyanand\Downloads\na.csv"
eu_file_path = r"C:\Users\heyanand\Downloads\eu.csv"

# Read the CSV files into pandas dataframes
na_df = pd.read_csv(na_file_path)
eu_df = pd.read_csv(eu_file_path)

# Print the first few rows of each dataframe to verify the import
print("North America DataFrame:")
print(na_df.head())
print("\nEurope DataFrame:")
print(eu_df.head())"""

In [1]:
import numpy as np
import pandas as pd

In [2]:
labels = ['a','b','c']
my_data =[10,20,30]
arr=np.array(my_data)
d = {'a':10,'b':20,'c':30}

In [3]:
# craete a pandas series
pd.Series(data=my_data)

0    10
1    20
2    30
dtype: int64

In [4]:
# craete a pandas series with custom labels
pd.Series(data=my_data, index=labels)

a    10
b    20
c    30
dtype: int64

In [5]:
# short way to craete a pandas series with custom labels
pd.Series(my_data, labels)

a    10
b    20
c    30
dtype: int64

In [6]:
# create a pandas series from a numpy array
pd.Series(arr,labels)

a    10
b    20
c    30
dtype: int64

In [7]:
#craete a pandas series from a dictionary 
pd.Series(d)

a    10
b    20
c    30
dtype: int64

In [9]:
#using pandas series index to find data
ser1 = pd.Series([1,2,3,4],['USA','Germany','USSR','Japan'])
ser1

USA        1
Germany    2
USSR       3
Japan      4
dtype: int64

In [10]:
ser2 = pd.Series([1,2,5,4],['USA','Germany','Italy','Japan'])
ser2

USA        1
Germany    2
Italy      5
Japan      4
dtype: int64

In [11]:
ser1['USA']

np.int64(1)

In [13]:
ser3 = pd.Series(data=labels)
ser3[0]

'a'

In [14]:
ser1+ser2

Germany    4.0
Italy      NaN
Japan      8.0
USA        2.0
USSR       NaN
dtype: float64

In [ ]:
#when we add two pandas serieses then python will look for common indexes and add them, and will also convert integers to floats.

### DataFrames ###

In [18]:
from numpy.random import randn
np.random.seed(101) # finxing a seed to keep the same random numbers

In [19]:
df = pd.DataFrame(data=randn(5,4),index=['A','B','C','D','E'],columns=['W','X','Y','Z'])
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [39]:
#find how many rows & columns are there in a df:
df.shape
#df.shape method returns a tuple

(5, 4)

In [40]:
#select a column in a df
df['W']

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [41]:
#one column selected from a df is of series datatype. This shows a df is a group of series linked to the same index (rows)
type(df['W'])

pandas.core.series.Series

In [42]:
#to find multiple columns from a df, pass a list of column names
df[['W','X']]

          W         X
A  2.706850  0.628133
B  0.651118 -0.319318
C -2.018168  0.740122
D  0.188695 -0.758872
E  0.190794  1.978757

In [43]:
#to create a new column, write the new column as if it already exists and assign the values
df['new']= df['W']+df['Y']
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [44]:
#to drop a colum use the drop function, followed by the column name , and set axis = 1
#df.drop by itself wont delete the column from the dataframe, it will just exlude to include the specified columns in the current line
#to delete the column, we need to pass inplace=TRUE
print(df.drop('new',axis =1))
print(df)

df.drop('new',axis =1, inplace=True)
print(df)

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509
          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762
          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [45]:
#df.drop can also be used for rows, just select axis =0 or dont mention axis at all, default is rows
df.drop('A')

          W         X         Y         Z
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [46]:
""" there are two ways to access rows in a df:
one by using row labels: using df.loc
2nd by using row indexes: using df.iloc
rows are also stored as series with column names being the index of items in each row
"""

df.loc['C']

W   -2.018168
X    0.740122
Y    0.528813
Z   -0.589001
Name: C, dtype: float64

In [47]:
df.iloc[2]

W   -2.018168
X    0.740122
Y    0.528813
Z   -0.589001
Name: C, dtype: float64

In [49]:
# to select 1 item in a df:
df.loc['B','Y']

np.float64(-0.8480769834036315)

In [50]:
# to select a subset matrix in a df:
df.loc[['A','B'],['X','Z']]

          X         Z
A  0.628133  0.503826
B -0.319318  0.605965

# Conditional Selection #

In [53]:
# if we want to filter for all the rows where a condition is met from values in one column:
bool_df = df['W'] > 0
print(bool_df)
df[bool_df]

A     True
B     True
C    False
D     True
E     True
Name: W, dtype: bool

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [55]:
#in one step:
df[df['W']>0]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [56]:
#to select just one or few columns from the result of a conditional filter df, use:
result_df=df[df['W']>0]
result_df['X']

A    0.628133
B   -0.319318
D   -0.758872
E    1.978757
Name: X, dtype: float64

In [57]:
#on in one step:
df[df['W']>0]['X']

A    0.628133
B   -0.319318
D   -0.758872
E    1.978757
Name: X, dtype: float64

In [63]:
df[df['W']>0][['X','Y']]

          X         Y
A  0.628133  0.907969
B -0.319318 -0.848077
D -0.758872 -0.933237
E  1.978757  2.605967

In [64]:
#multiple filtering conditions: use & for and and | for or
# where W values are > 0 and Y are > 1
df[(df['W']>0) & (df['Y']>1)]

          W         X         Y         Z
E  0.190794  1.978757  2.605967  0.683509

In [65]:
# where W values are > 0 OR Y are > 1
df[(df['W']>0) | (df['Y']>1)]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

# Reset index

In [67]:
#this reets the index to 0,1,.. and changes the current index to a new column named 'index'
df.reset_index()

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [74]:
new_index = 'CA NY WY OR CO'.split()

In [75]:
#to change the index to a new column
df['states']=new_index
print(df)

          W         X         Y         Z states
A  2.706850  0.628133  0.907969  0.503826     CA
B  0.651118 -0.319318 -0.848077  0.605965     NY
C -2.018168  0.740122  0.528813 -0.589001     WY
D  0.188695 -0.758872 -0.933237  0.955057     OR
E  0.190794  1.978757  2.605967  0.683509     CO

In [76]:
df.set_index('states') # this removes the old index

               W         X         Y         Z
states
CA      2.706850  0.628133  0.907969  0.503826
NY      0.651118 -0.319318 -0.848077  0.605965
WY     -2.018168  0.740122  0.528813 -0.589001
OR      0.188695 -0.758872 -0.933237  0.955057
CO      0.190794  1.978757  2.605967  0.683509